{
  "main": {
    "name": "Jordan Nervin",
    "occupation": "Seinor Full Stack Developer",
    "description": "",
    "image": "profilepic.jpg",
    "bio": [
      {"bio": "As a senior Full Stack developer, I bring a wealth of experience and expertise to the table. With a strong background in both Front-end and Back-end development, I have a deep understanding of how to build robust, scalable web and mobile applications that can handle complex workflows and data processing."},
      {"bio": "I am proficient in programming languages such as JavaScript, Python and SQL, and have rich experience in developing applications using frameworks such as React, React Native, Next.js, Django and Node.js."},
      {"bio": "At the same time, I'm also well-versed in Blockchain technology and its potential to transform industries across the board. From creating smart contracts to developing decentralized applications, I'm passionate about leveraging Blockchain to create more transparent, secure, and efficient systems."},
      {"bio": "In my work, I prioritize a collaborative, iterative approach, always seeking feedback and looking for ways to improve my code and my process. Whether I'm working with a team or taking on solo projects, I strive to deliver high-quality results that exceed expectations and drive real business value."}
    ],
    "contactmessage": "Have a project for me? Think I'd be a good fit for your team? I'd love to hear from you, give me a shout by email or by using the form below if you'd like to get in contact with me.",
    "Warning": " Warning: Contact form not yet configured, please contact me via normal email for now",
    "email": "jordannervin.ele@gmail.com",
    "phone": "+1 276 243 4509",
    "telegram": "https://t.me/StrongWall11",
    "skype":"live:.cid.88989dcc83cc6709",
    "address": {
      "street": "2465 Carling Avenue",
      "city": "Ottawa",
      "state": "Ontario",
      "zip": "K1Z 7B5"
    },
    "website": "https://jordan-nervin.web.app",
    "resumedownload": "https://drive.google.com/file/d/1mSX1V6CmFbTrOflp5VOncFeckCUsnXVI/view?usp=share_link",
    "social": [
      {
        "name": "facebook",
        "url": "http://facebook.com/",
        "className": "fa fa-facebook"
      },
      {
        "name": "twitter",
        "url": "http://twitter.com",
        "className": "fa fa-twitter"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "http://instagram.com/",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "http://github.com/kryptify",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Here is my major skills",
    "education":
      {
        "school": "Chiba University",
        "degree": "Bachelor's Degree of Computer Science",
        "graduated": "April 2013",
        "description": "Here I took my Bachelors of Computer Science with a Software Engineering Specialty and achieved a much more thorough education in the underlying theory, concepts, and science behind more complex programming. It was here that I discovered my passion for scalable application programming (web and mobile), the security behind computer and application systems, and found that I have a knack for understanding complex algorithms.",
        "study": [
          {"study": "- Computer Science Fundamentals"},
          {"study": "- Object-Oriented Programming"},
          {"study": "- Data Structures and Algorithms"},
          {"study": "- Database Management Systems"},
          {"study": "- Software Engineering"},
          {"study": "- Operating Systems"},
          {"study": "- Computer Networks"},
          {"study": "- Artificial Intelligence"},
          {"study": "- Human-Computer Interaction"}
        ]
      },
    "work": [
      {
        "title": "Senior Full Stack Developer",
        "company": "Tintash",
        "years": "Feb 2022 - Feb 2023",
        "description1": "- Led the development of a content management system (CMS) using React.js, Node.js, and MySQL, enabling content creators to easily publish and manage articles, videos, and other multimedia content.",
        "description2": "- Worked with cross-functional teams to integrate third-party APIs and services, including payment gateways and shipping providers.",
        "description3": "- Developed and maintained a high-performance, low-latency back-end system using Node.js, Express, and MongoDB, capable of handling millions of transactions per day.",
        "description4": "- Implemented a continuous integration/continuous deployment (CI/CD) pipeline using Travis and Jenkins, ensuring fast and reliable deployment of new features and updates."
      },
      {
        "title": "Full Stack and Blockchain Developer ",
        "company": "Cubix",
        "years": "Dec 2019 - Jan 2022",
        "description1": "- Built multiple decentralized applications on the variety Blockchain platforms, including a decentralized exchange (DEX) and a supply chain tracking application.",
        "description2": "- Developed a decentralized application (dApp) using Ethereum Blockchain and Solidity programming language. The dApp enabled secure peer-to-peer transactions and was integrated with an off-chain payment gateway.",
        "description3": "- Implemented various types of smart contracts such as multi-signature wallets, automated market makers and token issuance contracts using Solidity, Rust and Go.",
        "description4": "- Built NFT minting sites, marketplaces, staking sites including ERC-721, ERC-1155 and integrated NFTs with dApps.",
        "description5": "- Implemented consensus algorithms such as PoW and PoS and developed the tokenomics for a new cryptocurrency project, including designing the token model and creating an economic model to determine the initial token distribution and incentives."
      },
      {
        "title": "Software Developer",
        "company": "ConvrtX",
        "years": "Nov 2017 - Nov 2019",
        "description1": "- Collaborated with a team of developers to build a cloud-based software solution using AWS and Azure platforms. The project involved implementing an agile development methodology and continuous integration and deployment (CI/CD) pipeline for faster releases.",
        "description2": "- Developed internal utilities and tools for quick and easy work with the user database. Part of them was included in the administration part of the application.",
        "description3": "- Designed and developed a mobile application for a startup using React Native framework. The app received positive feedback from users and was featured on the App Store and Google Play Store.",
        "description4": "- Collaborated with QA engineers to test and debug web applications to ensure that they meet quality standards and perform optimally across multiple browsers and devices.",
        "description5": "- Built a web-based e-commerce platform for a small business using Shopify and WordPress platforms."
      },
      {
        "title": "Senior Front-end Developer",
        "company": "Rikkeisoft",
        "years": "Feb 2015 - Jun 2017",
        "description1": "- Created a React front-end admin dashboard for complex table data visualization with user-friendly search features.",
        "description2": "- Made a mobile version for an already existing website suitable for all platforms and browsers.",
        "description3": "- Designed a notification utility that can be used for drafting, scheduling, or executing any kind of notification along with Webhooks for a client's custom implementation.",
        "description4": "- Led the front-end development of a education software product using React and Redux frameworks.",
        "description5": "- Worked closely with back-end developers to ensure seamless integration and optimal user experience. Developed APIs and implemented front-end caching mechanisms to improve performance and reduce server load.",
        "description6": "- Collaborated with UX designers to ensure that web designs are translated into user-friendly and responsive web pages. Developed reusable and modular components and implemented design systems to ensure consistency across the website."
      },
      {
        "title": "Junior Web Developer",
        "company": "OpenConcept Consulting INC.",
        "years": "Feb 2014 - Jan 2015",
        "description1": "- Worked with other React developers to build user interfaces and components using React, Redux, and other modern front-end technologies.",
        "description2": "- Worked on the front-end development of a website using a CMS such as WordPress or Shopify. Developed custom themes, implemented plugins, and ensured website performance.",
        "description3": "- Conducted research on emerging web technologies and provided recommendations on how to incorporate them into web development projects.",
        "description4": "- Developed and maintained code repositories using Git for version control, ensuring that code is properly documented and organized.",
        "description5": "- Worked with UX designers to ensure that web designs are translated into user-friendly and responsive web pages.",
        "description6": "- Built small-scale web projects such as landing pages, microsites, or email templates."
      }
    ],
    "skills": [
      {
        "name": "GIT",
        "level": "80%"
      },
      {
        "name": "REACT",
        "level": "90%"
      },
      {
        "name": "BLOCKCHAIN",
        "level": "80%"
      },
      {
        "name": "NODEJS",
        "level": "80%"
      },
      {
        "name": "HTML5",
        "level": "95%"
      },
      {
        "name": "CSS",
        "level": "90%"
      },
      {
        "name": "JavaScript",
        "level": "80%"
      },
      {
        "name": "WEB3",
        "level": "80%"
      },
      {
        "name": "VueJs",
        "level": "50%"
      },
      {
        "name": "PYTHON",
        "level": "80%"
      },
      {
        "name": "MongoDB",
        "level": "85%"
      },
      {
        "name": "SQL",
        "level": "70%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Luuna",
        "category": "Ecommerce system",
        "image": "luuna.PNG",
        "url": "https://luuna.mx/"
      },
      {
        "title": "Ecodollar",
        "category": "EcoDollar is classified as a crypto payment token.",
        "image": "ecodollar.PNG",
        "url": "https://ecodollar.org/"
      },
      {
        "title": "Practiceplaygrow",
        "category": "Education web site",
        "image": "practiceplaygrow.png",
        "url": "https://practiceplaygrow.com/"
      },
      {
        "title": "Homeunion",
        "category": "Real estate investment site",
        "image": "homeunion.PNG",
        "url": "hhttps://www.homeunion.com/"
      },
      {
        "title": "Crypstarter",
        "category": "Olympus DAO fork",
        "image": "crypstarter.PNG",
        "url": "http://app.crypstarter.finance/"
      },
      {
        "title": "Peaceswap",
        "category": "Pancakeswap fork",
        "image": "peaceswap.PNG",
        "url": "https://peaceswap.com"
      },
      {
        "title": "CYOP",
        "category": "Crypto investment protocol website",
        "image": "cyop.png",
        "url": "https://cyop.io"
      },
      {
        "title": "Medabots",
        "category": "Play and earn NFT game",
        "image": "medabots.PNG",
        "url": "https://medabots.game/"
      },
      {
        "title": "Pliantinc",
        "category": "Ecommerce with Wordpress",
        "image": "pliantinc.PNG",
        "url": "http://www.pliantinc.com/"
      },
      {
        "title": "Rakabdar",
        "category": "Marketplace mobile application",
        "image": "rakabdar.png",
        "url": "https://play.google.com/store/apps/details?id=com.rakabdar.customer"
      },
      {
        "title": "Knowland",
        "category": "Insights, TargetNet & RS360 main module",
        "image": "knowland.png",
        "url": "https://www.knowland.com/"
      },
      {
        "title": "Resume",
        "category": "My resume with React template",
        "image": "resume.png",
        "url": "#"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "name": "Certified Front-End Web Developer",
        "date": "05/2016",
        "description_1": "Issued by Free Code Camp.",
        "description_2": "This certification validates proficiency in HTML, CSS, JavaScript, and other front-end web technologies, including responsive design, accessibility, and user experience."
      },
      {
        "name": "Certified Professional in Web Accessibility (CPWA)",
        "date": "02/2019",
        "description_1": "Issued by International Association of Accessibility Professionals (IAAP).",
        "description_2": "This certification validates knowledge and expertise in web accessibility standards and guidelines, including WCAG 2.0 and Section 508 compliance."
      },
      {
        "name": "Certified Information Systems Security Professional (CISSP)",
        "date": "10/2019",
        "description_1": "Issued by International Information Systems Security Certification Consortium (ISC)².",
        "description_2": "This certification validates knowledge and expertise in information security, including topics such as access control, cryptography, network security, and software development security."
      },
      {
        "name": "Hyperledger Fabric Developer (HFD)",
        "date": "08/2021",
        "description_1": "Issued by Linux Foundation.",
        "description_2": "This certification validates my skills in developing applications on the Hyperledger Fabric Blockchain, including chaincode development, network setup, and operations."
      }
    ]
  }
}
